<!-- dflook/terraform-github-actions {"workspace":"multiple_vars-2","backend_type":"remote","backend":"5bb2e2ab15b973887f01c1e6b4be8a72468e3c92cd6fa1f24fef1acead2d523d","plan_job_ref":"Job Test Terraform cloud #363 at https://github.com/dflook/terraform-github-actions/actions/runs/20956299602","plan_hash":"0e9f51060c8e46c9f530d791d20a7acc89be4e91b0047a1f9866968e7215e222","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __multiple_vars-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   default        = "default"
+   from_tfvars    = "from_tfvars"
+   from_variables = "from_variables"
```
</details>

:white_check_mark: Plan applied in [Test Terraform cloud #363](https://github.com/dflook/terraform-github-actions/actions/runs/20956299602)
<details open><summary>Outputs</summary>

```hcl
default        = "default"
from_tfvars    = "from_tfvars"
from_variables = "from_variables"
```
</details>